app/Models/Admin_m.php

SELECT *
FROM `setting`
WHERE `id` = 1
---
    public function get_setting($id = 1)
    {
        $builder = $this->db->table('setting');
        $builder->where('id', $id);
        return $builder->get()->getRowArray();