app/Models/User_m.php

    public function get_user_info($user_id = 0)
    {
        $builder = $this->db->table('users');
        $builder->select('*');
        $builder->where('id', $user_id);
        $row = $builder->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'

    public function get_all_user()
    {
        $builder = $this->db->table('users');
        $builder->select('*');
        $builder->where('status', 1);
        $row = $builder->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `status` = 1

    public function get_setting($id = 1)
    {
        $builder = $this->db->table('setting');
        $builder->where('id', $id);
        return $builder->get()->getRowArray();
---
SELECT *
FROM `setting`
WHERE `id` = 1